app/views/animals/index.html.erb

        <td><%= animal.kingdom %></td>
        <td style="text-align: center"><%=link_to animal.sightings.count, animal_path(animal.id) %></td>
---
SELECT COUNT(*) FROM "sightings" WHERE "sightings"."animal_id" = $1  [["animal_id", 1]]