app/views/animals/show.html.erb

SELECT "sightings".* FROM "sightings" WHERE "sightings"."animal_id" = $1  [["animal_id", 1]]
---
  <ul>
    <% @animal.sightings.each do |sighting| %>