app/controllers/animals_controller.rb

INSERT INTO "animals" ("name", "latin_name", "kingdom", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Bear"], ["latin_name", "Bearilius"], ["kingdom", "Mammal"], ["created_at", "2017-03-14 21:50:49.207691"], ["updated_at", "2017-03-14 21:50:49.207691"]]
---
  def create
    @animal = Animal.new(animal_params)

    respond_to do |format|
      if @animal.save

DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 2]]
---
  def destroy
    @animal.destroy

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_animal
      @animal = Animal.find(params[:id])