app/controllers/sightings_controller.rb

SELECT "sightings".* FROM "sightings" WHERE ("sightings"."date" BETWEEN '2017-03-10' AND '2017-03-17')
SELECT "sightings".* FROM "sightings" WHERE "sightings"."region" = $1  [["region", "Pearl District"]]
SELECT "sightings".* FROM "sightings"
---
  def index
    if params[:start_date].present?
      @sightings = Sighting.where(date: params[:start_date]..params[:end_date])
      render('sightings/index.html.erb')
    elsif params[:region].present?
      @sightings = Sighting.where(region: params[:region])
      render('sightings/index.html.erb')
    else
      @sightings = Sighting.all

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "animals".* FROM "animals"
---
  def new
    @sighting = Sighting.new
    if params[:animal_id].present?
      @sighting.animal = Animal.find(params[:animal_id])
    end
    @animals_for_select = Animal.all.map do |animal|

SELECT "animals".* FROM "animals"
---
  def edit
    @animals_for_select = Animal.all.map do |animal|

SELECT "animals".* FROM "animals"
INSERT INTO "sightings" ("animal_id", "latitude", "longitude", "region", "date", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @sighting = Sighting.new(sighting_params)
    @animals_for_select = Animal.all.map do |animal|
      [animal.name, animal.id]
    end

    respond_to do |format|
      if @sighting.save

UPDATE "sightings" SET "region" = $1, "updated_at" = $2 WHERE "sightings"."id" = $3  [["region", "OldTown ChinaTown"], ["updated_at", "2017-03-14 23:18:53.652202"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @sighting.update(sighting_params)

DELETE FROM "sightings" WHERE "sightings"."id" = $1  [["id", 10]]
---
  def destroy
    @sighting.destroy

SELECT "sightings".* FROM "sightings"
---
  def get_sightings
    @sightings = Sighting.all

SELECT  "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT 1  [["id", 10]]
---
    def set_sighting
      @sighting = Sighting.find(params[:id])